; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-75)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b11)
    (on-table b11)
    (clear b8)
    (on b8 b2)
    (on b2 b16)
    (on b16 b4)
    (on b4 b17)
    (on b17 b3)
    (on b3 b9)
    (on b9 b1)
    (on b1 b21)
    (on b21 b14)
    (on b14 b7)
    (on b7 b10)
    (on b10 b22)
    (on b22 b13)
    (on b13 b19)
    (on b19 b18)
    (on b18 b6)
    (on b6 b12)
    (on b12 b20)
    (on b20 b5)
    (on-table b5))
 (:goal (and 
(on b3 b22)
))
)

; plan
1. (unstack b8 b2)
   deleted: (on b8 b2) (clear b8) (arm-empty)
   added: (holding b8) (clear b2)
   goals met: 0 of 1
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
3. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 0 of 1
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
5. (unstack b16 b4)
   deleted: (on b16 b4) (clear b16) (arm-empty)
   added: (holding b16) (clear b4)
   goals met: 0 of 1
6. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
7. (unstack b4 b17)
   deleted: (on b4 b17) (clear b4) (arm-empty)
   added: (holding b4) (clear b17)
   goals met: 0 of 1
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
9. (unstack b17 b3)
   deleted: (on b17 b3) (clear b17) (arm-empty)
   added: (holding b17) (clear b3)
   goals met: 0 of 1
10. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
11. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 0 of 1
12. (stack b3 b15)
   deleted: (clear b15) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b15)
   goals met: 0 of 1
13. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 0 of 1
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
15. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 0 of 1
16. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
17. (unstack b21 b14)
   deleted: (on b21 b14) (clear b21) (arm-empty)
   added: (holding b21) (clear b14)
   goals met: 0 of 1
18. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
19. (unstack b14 b7)
   deleted: (on b14 b7) (clear b14) (arm-empty)
   added: (holding b14) (clear b7)
   goals met: 0 of 1
20. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
21. (unstack b7 b10)
   deleted: (on b7 b10) (clear b7) (arm-empty)
   added: (holding b7) (clear b10)
   goals met: 0 of 1
22. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
23. (unstack b10 b22)
   deleted: (on b10 b22) (clear b10) (arm-empty)
   added: (holding b10) (clear b22)
   goals met: 0 of 1
24. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
25. (unstack b3 b15)
   deleted: (on b3 b15) (clear b3) (arm-empty)
   added: (holding b3) (clear b15)
   goals met: 0 of 1
26. (stack b3 b22)
   deleted: (clear b22) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b22)
   goals met: 1 of 1
